Study2/src/Documents/ПродажаУцененногоТовара/ПродажаУцененногоТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПродажаУцененногоТовара</name>
  <basedOn>Document.УценкаТовара</basedOn>
  <registerRecords>AccumulationRegister.ПродажаТовара</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТовара</registerRecords>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>SN</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Study2/src/Documents/ПродажаУцененногоТовара/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивОшибок = Новый Массив;
	
	Если Не ЗначениеЗаполнено(Филиал) Тогда
		МассивОшибок.Добавить("Филиал не можен быть пустым");
	КонецЕсли;
	
	Если МассивОшибок.Количество() > 0 Тогда
		Отказ = Истина;
		Сообщить(СтрСоединить(МассивОшибок, Символы.ПС));
	КонецЕсли;
	
	ПроверяемыеРеквизиты.Добавить("Автор");
	ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Склад"));
	
КонецПроцедуры 

&НаКлиенте
Процедура ПровестиРаспровести()
	
	Если Не ПроверитьЗаполнение() ТОгда
		Возврат;
	КонецЕсли;
	ПровестираспровестинаСервере();
	
КонецПроцедуры


Процедура ПриКопировании(ОбъектКопирования)  
	
	Автор = Неопределено;
	Контрагент = Неопределено;
	Дата = ТекущаяДата();
	
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.УценкаТовара") Тогда
		// Заполнение шапки
		Автор = ДанныеЗаполнения.Автор;
		Склад = ДанныеЗаполнения.Склад;
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
		Филиал = ДанныеЗаполнения.Филиал;
		Для Каждого ТекСтрокаСостав Из ДанныеЗаполнения.Состав Цикл
			НоваяСтрока = Номенклатура.Добавить();
			НоваяСтрока.SN = ТекСтрокаСостав.SN;
			НоваяСтрока.Цена = ТекСтрокаСостав.НоваяЦена;
			НоваяСтрока.Номенклатура = ТекСтрокаСостав.Номенклатура;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
